In [164]:
from pyhive import hive
import pymysql
conn = hive.Connection(host='127.0.0.1', port=10000, username='hadoop')
cursor = conn.cursor()

In [2]:
def exec_sql(sql):
    cursor.execute(sql)
    for result in cursor.fetchall():
        print(result)

# table_6_relation_among_date_class_boxo(年份、类别与票房的关系)

注：由于样本的数据只有近三年的，所以本来想按上下半年分，但是这样的话，代码量会爆炸，考虑到后续还有工作要做，索性就按三年分了

# 2016

In [156]:
cursor.execute("DROP TABLE IF EXISTS relation_among_date_class_boxo")

In [157]:
create_table_relation_among_date_class_boxo_sql = '''create table relation_among_date_class_boxo(ftime string,class string,boxoffice float)'''

In [158]:
cursor.execute(create_table_relation_among_date_class_boxo_sql)

In [159]:
del create_table_relation_among_date_class_boxo_sql

爱情

In [2]:
t_romance_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_romance',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_romance=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [3]:
cursor.execute(t_romance_sql)

In [9]:
del t_romance_sql

喜剧

In [10]:
t_comedy_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_comedy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_comedy=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [11]:
cursor.execute(t_comedy_sql)

In [12]:
del t_comedy_sql

动画

In [13]:
t_animate_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_animate',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_animate=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [14]:
cursor.execute(t_animate_sql)

In [15]:
del t_animate_sql

剧情

In [16]:
t_plot_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_plot',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_plot=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [17]:
cursor.execute(t_plot_sql)

In [18]:
del t_plot_sql

恐怖

In [19]:
t_horror_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_horror',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_horror=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [20]:
cursor.execute(t_horror_sql)

In [21]:
del t_horror_sql

惊悚

In [22]:
t_thriller_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_thriller',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_thriller=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [23]:
cursor.execute(t_thriller_sql)

In [24]:
del t_thriller_sql

科幻

In [25]:
t_science_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_science',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_science=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [26]:
cursor.execute(t_science_sql)

In [27]:
del t_science_sql

动作

In [28]:
t_action_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_action',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_action=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [29]:
cursor.execute(t_action_sql)

In [30]:
del t_action_sql

悬疑

In [31]:
t_suspense_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_suspense',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_suspense=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [32]:
cursor.execute(t_suspense_sql)

In [33]:
del t_suspense_sql

犯罪

In [34]:
t_crime_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_crime',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_crime=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [35]:
cursor.execute(t_crime_sql)

In [36]:
del t_crime_sql

冒险

In [37]:
t_adventure_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_adventure',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_adventure=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [38]:
cursor.execute(t_adventure_sql)

In [39]:
del t_adventure_sql

战争

In [40]:
t_war_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_war',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_war=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [41]:
cursor.execute(t_war_sql)

In [42]:
del t_war_sql

奇幻

In [43]:
t_fantasy_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_fantasy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_fantasy=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [44]:
cursor.execute(t_fantasy_sql)

In [45]:
del t_fantasy_sql

运动

In [46]:
t_sports_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_sports',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_sports=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [47]:
cursor.execute(t_sports_sql)

In [48]:
del t_sports_sql

家庭

In [49]:
t_family_sql ='''insert into table relation_among_date_class_boxo SELECT '2016','t_family',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_family=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [50]:
cursor.execute(t_family_sql)

In [51]:
del t_family_sql

古装

In [52]:
t_costume_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_costume',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_costume=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [53]:
cursor.execute(t_costume_sql)

In [54]:
del t_costume_sql

武侠

In [55]:
t_sword_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_sword',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_sword=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [56]:
cursor.execute(t_sword_sql)

In [57]:
del t_sword_sql

西部

In [58]:
t_cowboy_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_cowboy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_cowboy=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [59]:
cursor.execute(t_cowboy_sql)

In [60]:
del t_cowboy_sql

历史

In [61]:
t_history_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_history',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_history=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [62]:
cursor.execute(t_history_sql)

In [63]:
del t_history_sql

传记

In [64]:
t_biography_sql ='''insert into table relation_among_date_class_boxo SELECT '2016','t_biography',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_biography=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [65]:
cursor.execute(t_biography_sql)

In [66]:
del t_biography_sql

歌舞

In [67]:
t_dance_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_dance',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_dance=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [68]:
cursor.execute(t_dance_sql)

In [69]:
del t_dance_sql

黑色电影

In [70]:
t_dark_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_dark',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_dark=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [71]:
cursor.execute(t_dark_sql)

In [72]:
del t_dark_sql

短片

In [73]:
t_short_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_short',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_short=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [75]:
cursor.execute(t_short_sql)

In [76]:
del t_short_sql

纪录片

In [77]:
t_documentary_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_documentary',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_documentary=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [78]:
cursor.execute(t_documentary_sql)

In [79]:
del t_documentary_sql

其他

In [80]:
t_others_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','t_others',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_others=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [81]:
cursor.execute(t_others_sql)

In [82]:
del t_others_sql

大陆

In [83]:
c_Mainland_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','c_Mainland',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Mainland=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [84]:
cursor.execute(c_Mainland_sql)

In [85]:
del c_Mainland_sql

美国

In [86]:
c_America_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','c_America',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_America=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [87]:
cursor.execute(c_America_sql)

In [88]:
del c_America_sql

韩国

In [97]:
c_Korea_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','c_Korea',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Korea=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [98]:
cursor.execute(c_Korea_sql)

In [99]:
del c_Korea_sql

日本

In [100]:
c_Japan_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','c_Japan',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Japan=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [101]:
cursor.execute(c_Japan_sql)

In [102]:
del c_Japan_sql

香港

In [103]:
c_Hongkong_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','c_Hongkong',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Hongkong=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [104]:
cursor.execute(c_Hongkong_sql)

In [105]:
del c_Hongkong_sql

台湾

In [106]:
c_Taiwan_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','c_Taiwan',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Taiwan=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [107]:
cursor.execute(c_Taiwan_sql)

In [108]:
del c_Taiwan_sql

泰国

In [109]:
c_Thailand_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','c_Thailand',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Thailand=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [110]:
cursor.execute(c_Thailand_sql)

In [111]:
del c_Thailand_sql

印度

In [112]:
c_India_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','c_India',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_India=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [113]:
cursor.execute(c_India_sql)

In [114]:

del c_India_sql

法国

In [115]:
c_France_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','c_France',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_France=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [116]:
cursor.execute(c_France_sql)

In [117]:
del c_France_sql

英国

In [118]:
c_England_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','c_England',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_England=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [119]:
cursor.execute(c_England_sql)

In [120]:
del c_England_sql

俄罗斯

In [121]:
c_Russia_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','c_Russia',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Russia=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [122]:
cursor.execute(c_Russia_sql)

In [123]:
del c_Russia_sql

意大利

In [124]:
c_Italy_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','c_Italy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Italy=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [125]:
cursor.execute(c_Italy_sql)

In [126]:
del c_Italy_sql

西班牙

In [127]:
c_Spain_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','c_Spain',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Spain=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [128]:
cursor.execute(c_Spain_sql)

In [129]:
del c_Spain_sql

德国

In [130]:
c_Germany_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','c_Germany',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Germany=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [133]:
cursor.execute(c_Germany_sql)

In [134]:
del c_Germany_sql

波兰

In [135]:
c_Poland_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','c_Poland',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Poland=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [136]:
cursor.execute(c_Poland_sql)

In [137]:
del c_Poland_sql

澳大利亚

In [138]:
c_Australia_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','c_Australia',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Australia=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [139]:
cursor.execute(c_Australia_sql)

In [140]:
del c_Australia_sql

伊朗

In [141]:
c_Iran_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','c_Iran',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Iran=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [142]:
cursor.execute(c_Iran_sql)

In [143]:
del c_Iran_sql

其他

In [144]:
c_Others_sql = '''insert into table relation_among_date_class_boxo SELECT '2016','c_Others',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Others=1 and mdate < '2016-12-31'and mdate >'2016-01-01') t2'''

In [145]:
cursor.execute(c_Others_sql)

In [146]:
del c_Others_sql

# 2017

爱情

In [147]:
t_romance_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_romance',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_romance=1 and mdate <='2017-12-31'and mdate >='2017-01-01') t2'''

In [148]:
cursor.execute(t_romance_sql)

In [149]:
del t_romance_sql

喜剧

In [150]:
t_comedy_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_comedy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_comedy=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [151]:
cursor.execute(t_comedy_sql)

In [152]:
del t_comedy_sql

动画

In [153]:
t_animate_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_animate',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_animate=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [154]:
cursor.execute(t_animate_sql)

In [155]:
del t_animate_sql

剧情

In [4]:
t_plot_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_plot',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_plot=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [5]:
cursor.execute(t_plot_sql)

In [ ]:
del t_plot_sql

恐怖

In [6]:
t_horror_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_horror',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_horror=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [7]:
cursor.execute(t_horror_sql)

In [ ]:
del t_horror_sql

惊悚

In [8]:
t_thriller_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_thriller',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_thriller=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [9]:
cursor.execute(t_thriller_sql)

In [10]:
del t_thriller_sql

科幻

In [11]:
t_science_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_science',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_science=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [12]:
cursor.execute(t_science_sql)

In [13]:
del t_science_sql

动作

In [14]:
t_action_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_action',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_action=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [15]:
cursor.execute(t_action_sql)

In [16]:
del t_action_sql

悬疑

In [17]:
t_suspense_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_suspense',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_suspense=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [18]:
cursor.execute(t_suspense_sql)

In [19]:
del t_suspense_sql

犯罪

In [20]:
t_crime_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_crime',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_crime=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [21]:
cursor.execute(t_crime_sql)

In [22]:
del t_crime_sql

冒险

In [23]:
t_adventure_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_adventure',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_adventure=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [24]:
cursor.execute(t_adventure_sql)

In [25]:
del t_adventure_sql

战争

In [26]:
t_war_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_war',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_war=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [27]:
cursor.execute(t_war_sql)

In [28]:
del t_war_sql

奇幻

In [29]:
t_fantasy_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_fantasy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_fantasy=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [30]:
cursor.execute(t_fantasy_sql)

In [31]:
del t_fantasy_sql

运动

In [32]:
t_sports_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_sports',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_sports=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [33]:
cursor.execute(t_sports_sql)

In [34]:
del t_sports_sql

家庭

In [35]:
t_family_sql ='''insert into table relation_among_date_class_boxo SELECT '2017','t_family',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_family=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [36]:
cursor.execute(t_family_sql)

In [37]:
del t_family_sql

古装

In [38]:
t_costume_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_costume',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_costume=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [39]:
cursor.execute(t_costume_sql)

In [40]:
del t_costume_sql

武侠

In [41]:
t_sword_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_sword',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_sword=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [42]:
cursor.execute(t_sword_sql)

In [43]:
del t_sword_sql

西部

In [44]:
t_cowboy_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_cowboy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_cowboy=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [45]:
cursor.execute(t_cowboy_sql)

In [46]:
del t_cowboy_sql

历史

In [47]:
t_history_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_history',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_history=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [48]:
cursor.execute(t_history_sql)

In [49]:
del t_history_sql

传记

In [50]:
t_biography_sql ='''insert into table relation_among_date_class_boxo SELECT '2017','t_biography',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_biography=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [51]:
cursor.execute(t_biography_sql)

In [52]:
del t_biography_sql

歌舞

In [53]:
t_dance_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_dance',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_dance=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [54]:
cursor.execute(t_dance_sql)

In [55]:
del t_dance_sql

黑色电影

In [56]:
t_dark_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_dark',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_dark=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [57]:
cursor.execute(t_dark_sql)

In [58]:
del t_dark_sql

短片

In [59]:
t_short_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_short',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_short=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [61]:
cursor.execute(t_short_sql)

In [62]:
del t_short_sql

纪录片

In [63]:
t_documentary_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_documentary',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_documentary=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [64]:
cursor.execute(t_documentary_sql)

In [65]:
del t_documentary_sql

其他

In [66]:
t_others_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','t_others',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_others=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [67]:
cursor.execute(t_others_sql)

In [68]:
del t_others_sql

大陆

In [69]:
c_Mainland_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','c_Mainland',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Mainland=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [70]:
cursor.execute(c_Mainland_sql)

In [71]:
del c_Mainland_sql

美国

In [72]:
c_America_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','c_America',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_America=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [73]:
cursor.execute(c_America_sql)

In [74]:
del c_America_sql

韩国

In [78]:
c_Korea_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','c_Korea',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Korea=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [79]:
cursor.execute(c_Korea_sql)

In [80]:
del c_Korea_sql

日本

In [81]:
c_Japan_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','c_Japan',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Japan=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [82]:
cursor.execute(c_Japan_sql)

In [83]:
del c_Japan_sql

香港

In [84]:
c_Hongkong_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','c_Hongkong',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Hongkong=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [85]:
cursor.execute(c_Hongkong_sql)

In [86]:
del c_Hongkong_sql

台湾

In [87]:
c_Taiwan_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','c_Taiwan',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Taiwan=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [88]:
cursor.execute(c_Taiwan_sql)

In [89]:
del c_Taiwan_sql

泰国

In [90]:
c_Thailand_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','c_Thailand',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Thailand=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [91]:
cursor.execute(c_Thailand_sql)

In [92]:
del c_Thailand_sql

印度

In [93]:
c_India_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','c_India',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_India=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [94]:
cursor.execute(c_India_sql)

In [95]:
del c_India_sql

法国

In [96]:
c_France_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','c_France',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_France=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [97]:
cursor.execute(c_France_sql)

In [98]:
del c_France_sql

英国

In [99]:
c_England_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','c_England',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_England=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [100]:
cursor.execute(c_England_sql)

In [101]:
del c_England_sql

俄罗斯

In [102]:
c_Russia_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','c_Russia',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Russia=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [103]:
cursor.execute(c_Russia_sql)

In [104]:
del c_Russia_sql

意大利

In [105]:
c_Italy_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','c_Italy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Italy=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [106]:
cursor.execute(c_Italy_sql)

In [107]:
del c_Italy_sql

西班牙

In [108]:
c_Spain_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','c_Spain',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Spain=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [109]:
cursor.execute(c_Spain_sql)

In [110]:
del c_Spain_sql

德国

In [111]:
c_Germany_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','c_Germany',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Germany=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [114]:
cursor.execute(c_Germany_sql)

In [115]:
del c_Germany_sql

波兰

In [116]:
c_Poland_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','c_Poland',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Poland=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [117]:
cursor.execute(c_Poland_sql)

In [118]:
del c_Poland_sql

澳大利亚

In [119]:
c_Australia_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','c_Australia',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Australia=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [120]:
cursor.execute(c_Australia_sql)

In [121]:
del c_Australia_sql

伊朗

In [122]:
c_Iran_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','c_Iran',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Iran=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [123]:
cursor.execute(c_Iran_sql)

In [124]:
del c_Iran_sql

其他

In [125]:
c_Others_sql = '''insert into table relation_among_date_class_boxo SELECT '2017','c_Others',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Others=1 and mdate < '2017-12-31'and mdate >'2017-01-01') t2'''

In [126]:
cursor.execute(c_Others_sql)

In [127]:
del c_Others_sql

# 2018

爱情

In [128]:
t_romance_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_romance',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_romance=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [129]:
cursor.execute(t_romance_sql)

In [130]:
del t_romance_sql

喜剧

In [131]:
t_comedy_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_comedy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_comedy=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [132]:
cursor.execute(t_comedy_sql)

In [133]:
del t_comedy_sql

动画

In [134]:
t_animate_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_animate',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_animate=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [135]:
cursor.execute(t_animate_sql)

In [136]:
del t_animate_sql

剧情

In [137]:
t_plot_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_plot',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_plot=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [138]:
cursor.execute(t_plot_sql)

In [139]:
del t_plot_sql

恐怖

In [140]:
t_horror_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_horror',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_horror=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [141]:
cursor.execute(t_horror_sql)

In [142]:
del t_horror_sql

惊悚

In [143]:
t_thriller_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_thriller',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_thriller=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [144]:
cursor.execute(t_thriller_sql)

In [145]:
del t_thriller_sql

科幻

In [146]:
t_science_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_science',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_science=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [147]:
cursor.execute(t_science_sql)

In [148]:
del t_science_sql

动作

In [149]:
t_action_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_action',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_action=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [150]:
cursor.execute(t_action_sql)

In [151]:
del t_action_sql

悬疑

In [152]:
t_suspense_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_suspense',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_suspense=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [153]:
cursor.execute(t_suspense_sql)

OperationalError: TExecuteStatementResp(operationHandle=None, status=TStatus(errorCode=2, infoMessages=['*org.apache.hive.service.cli.HiveSQLException:Error while processing statement: FAILED: Execution Error, return code 2 from org.apache.hadoop.hive.ql.exec.mr.MapRedTask:28:27', 'org.apache.hive.service.cli.operation.Operation:toSQLException:Operation.java:335', 'org.apache.hive.service.cli.operation.SQLOperation:runQuery:SQLOperation.java:226', 'org.apache.hive.service.cli.operation.SQLOperation:runInternal:SQLOperation.java:263', 'org.apache.hive.service.cli.operation.Operation:run:Operation.java:247', 'org.apache.hive.service.cli.session.HiveSessionImpl:executeStatementInternal:HiveSessionImpl.java:541', 'org.apache.hive.service.cli.session.HiveSessionImpl:executeStatement:HiveSessionImpl.java:516', 'sun.reflect.GeneratedMethodAccessor75:invoke::-1', 'sun.reflect.DelegatingMethodAccessorImpl:invoke:DelegatingMethodAccessorImpl.java:43', 'java.lang.reflect.Method:invoke:Method.java:498', 'org.apache.hive.service.cli.session.HiveSessionProxy:invoke:HiveSessionProxy.java:78', 'org.apache.hive.service.cli.session.HiveSessionProxy:access$000:HiveSessionProxy.java:36', 'org.apache.hive.service.cli.session.HiveSessionProxy$1:run:HiveSessionProxy.java:63', 'java.security.AccessController:doPrivileged:AccessController.java:-2', 'javax.security.auth.Subject:doAs:Subject.java:422', 'org.apache.hadoop.security.UserGroupInformation:doAs:UserGroupInformation.java:1762', 'org.apache.hive.service.cli.session.HiveSessionProxy:invoke:HiveSessionProxy.java:59', 'com.sun.proxy.$Proxy42:executeStatement::-1', 'org.apache.hive.service.cli.CLIService:executeStatement:CLIService.java:282', 'org.apache.hive.service.cli.thrift.ThriftCLIService:ExecuteStatement:ThriftCLIService.java:563', 'org.apache.hive.service.rpc.thrift.TCLIService$Processor$ExecuteStatement:getResult:TCLIService.java:1557', 'org.apache.hive.service.rpc.thrift.TCLIService$Processor$ExecuteStatement:getResult:TCLIService.java:1542', 'org.apache.thrift.ProcessFunction:process:ProcessFunction.java:39', 'org.apache.thrift.TBaseProcessor:process:TBaseProcessor.java:39', 'org.apache.hive.service.auth.TSetIpAddressProcessor:process:TSetIpAddressProcessor.java:56', 'org.apache.thrift.server.TThreadPoolServer$WorkerProcess:run:TThreadPoolServer.java:286', 'java.util.concurrent.ThreadPoolExecutor:runWorker:ThreadPoolExecutor.java:1149', 'java.util.concurrent.ThreadPoolExecutor$Worker:run:ThreadPoolExecutor.java:624', 'java.lang.Thread:run:Thread.java:748'], errorMessage='Error while processing statement: FAILED: Execution Error, return code 2 from org.apache.hadoop.hive.ql.exec.mr.MapRedTask', statusCode=3, sqlState='08S01'))

In [ ]:
del t_suspense_sql

犯罪

In [ ]:
t_crime_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_crime',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_crime=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [ ]:
cursor.execute(t_crime_sql)

In [ ]:
del t_crime_sql

犯罪

In [ ]:
t_crime_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_crime',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_crime=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [ ]:
cursor.execute(t_crime_sql)

In [ ]:
del t_crime_sql

冒险

In [162]:
t_adventure_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_adventure',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_adventure=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [165]:
cursor.execute(t_adventure_sql)

In [166]:
del t_adventure_sql

战争

In [167]:
t_war_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_war',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_war=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [168]:
cursor.execute(t_war_sql)

In [169]:
del t_war_sql

奇幻

In [170]:
t_fantasy_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_fantasy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_fantasy=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [171]:
cursor.execute(t_fantasy_sql)

In [172]:
del t_fantasy_sql

运动

In [173]:
t_sports_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_sports',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_sports=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [174]:
cursor.execute(t_sports_sql)

In [175]:
del t_sports_sql

家庭

In [176]:
t_family_sql ='''insert into table relation_among_date_class_boxo SELECT '2018','t_family',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_family=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [177]:
cursor.execute(t_family_sql)

In [178]:
del t_family_sql

古装

In [179]:
t_costume_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_costume',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_costume=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [180]:
cursor.execute(t_costume_sql)

In [181]:
del t_costume_sql

武侠

In [182]:
t_sword_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_sword',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_sword=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [183]:
cursor.execute(t_sword_sql)

In [184]:
del t_sword_sql

西部

In [185]:
t_cowboy_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_cowboy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_cowboy=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [186]:
cursor.execute(t_cowboy_sql)

In [187]:
del t_cowboy_sql

历史

In [188]:
t_history_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_history',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_history=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [189]:
cursor.execute(t_history_sql)

In [190]:
del t_history_sql

传记

In [191]:
t_biography_sql ='''insert into table relation_among_date_class_boxo SELECT '2018','t_biography',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_biography=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [192]:
cursor.execute(t_biography_sql)

In [193]:
del t_biography_sql

歌舞

In [194]:
t_dance_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_dance',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_dance=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [195]:
cursor.execute(t_dance_sql)

In [196]:
del t_dance_sql

黑色电影

In [197]:
t_dark_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_dark',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_dark=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [198]:
cursor.execute(t_dark_sql)

In [199]:
del t_dark_sql

短片

In [205]:
t_short_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_short',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_short=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [206]:
cursor.execute(t_short_sql)

In [207]:
del t_short_sql

纪录片

In [208]:
t_documentary_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_documentary',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_documentary=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [209]:
cursor.execute(t_documentary_sql)

In [210]:
del t_documentary_sql

其他

In [211]:
t_others_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','t_others',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.t_others=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [212]:
cursor.execute(t_others_sql)

In [213]:
del t_others_sql

大陆

In [214]:
c_Mainland_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','c_Mainland',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Mainland=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [215]:
cursor.execute(c_Mainland_sql)

In [216]:
del c_Mainland_sql

美国

In [217]:
c_America_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','c_America',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_America=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [218]:
cursor.execute(c_America_sql)

In [219]:
del c_America_sql

韩国

In [222]:
c_Korea_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','c_Korea',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Korea=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [223]:
cursor.execute(c_Korea_sql)

In [224]:
del c_Korea_sql

日本

In [225]:
c_Japan_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','c_Japan',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Japan=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [226]:
cursor.execute(c_Japan_sql)

In [227]:

del c_Japan_sql

香港

In [228]:
c_Hongkong_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','c_Hongkong',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Hongkong=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [229]:
cursor.execute(c_Hongkong_sql)

In [230]:
del c_Hongkong_sql

台湾

In [231]:
c_Taiwan_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','c_Taiwan',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Taiwan=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [232]:
cursor.execute(c_Taiwan_sql)

In [233]:
del c_Taiwan_sql

泰国

In [234]:
c_Thailand_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','c_Thailand',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Thailand=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [235]:
cursor.execute(c_Thailand_sql)

In [236]:
del c_Thailand_sql

印度

In [237]:
c_India_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','c_India',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_India=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [238]:
cursor.execute(c_India_sql)

In [239]:
del c_India_sql

法国

In [240]:
c_France_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','c_France',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_France=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [241]:
cursor.execute(c_France_sql)

In [242]:
del c_France_sql

英国

In [243]:
c_England_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','c_England',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_England=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [244]:
cursor.execute(c_England_sql)

In [245]:
del c_England_sql

俄罗斯

In [246]:
c_Russia_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','c_Russia',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Russia=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [247]:
cursor.execute(c_Russia_sql)

In [248]:
del c_Russia_sql

意大利

In [249]:
c_Italy_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','c_Italy',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Italy=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [250]:
cursor.execute(c_Italy_sql)

In [251]:
del c_Italy_sql

西班牙

In [252]:
c_Spain_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','c_Spain',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Spain=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [253]:
cursor.execute(c_Spain_sql)

In [254]:
del c_Spain_sql

德国

In [255]:
c_Germany_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','c_Germany',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Germany=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [257]:
cursor.execute(c_Germany_sql)

In [258]:
del c_Germany_sql

波兰

In [259]:
c_Poland_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','c_Poland',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Poland=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [260]:
cursor.execute(c_Poland_sql)

In [261]:
del c_Poland_sql

澳大利亚

In [262]:
c_Australia_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','c_Australia',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Australia=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [263]:
cursor.execute(c_Australia_sql)

In [264]:
del c_Australia_sql

伊朗

In [265]:
c_Iran_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','c_Iran',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Iran=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [266]:
cursor.execute(c_Iran_sql)

In [267]:
del c_Iran_sql

其他

In [268]:
c_Others_sql = '''insert into table relation_among_date_class_boxo SELECT '2018','c_Others',t2.v FROM (SELECT SUM(t1.boxoffice) AS v FROM film44 t1 WHERE t1.c_Others=1 and mdate < '2018-12-31'and mdate >'2018-01-01') t2'''

In [269]:
cursor.execute(c_Others_sql)

In [270]:
del c_Others_sql